[
  {
    "id": "rkrsuoYE9Uw",
    "title": "Rainbow Rare Earths interview with CEO George Bennett",
    "date": "2025-05-22",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=rkrsuoYE9Uw",
        "platform": "YouTube"
      }
    ],
    "duration": "17m 53s",
    "duration_iso": "PT17M53S",
    "description": "Rainbow Rare Earths interview with CEO George Bennett  \nThanks to Donald Trump and his critical minerals or ‘Rare Earths’ deal with Ukraine, Rare Earths are perhaps better known than they have ever been. Despite the deal, our interview with Rainbow Rare Earths CEO George Bennett, a Rare Earths expert, confirms that any Rare Earths in Ukraine are of no commercial value, and even if they had value, it would take 20 years to get those into production.\n\nRainbow Rare Earths (London: RBW) specialise in turning phosphate gypsum feedstock from old mine waste into high-demand rare earths using a sophisticated patented chemical processing flowsheet. And Rainbow will  soon ‘probably be the lowest cost producer in the Western world’ – possibly even cheaper than China.\n\nGeorge Bennett and his team are patiently perfecting the technique in a South African pilot plant, working towards creating 99.5% pure Rare Earths for sale to Western countries. A Definitive Feasibility Study is due by the end of the year. \n\nThe supply of Rare Earths and pricing is currently controlled by the Chinese, who have ‘weaponised’ the supply chain according to George Bennett, which is why the DFC (Development Finance Corporation)  in Washington agreed $50M of financing 18 months ago for Phalaborwa, the main project in South Africa.\n\nRare Earths demand in the West is inevitably set to rise with the geopolitical friction between China and America. Various Rare Earths are used in everything from phones and consumer electronics to defence weaponry, and in particular for magnets in renewables wind turbines.",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/rkrsuoYE9Uw/default.jpg",
      "medium": "https://i.ytimg.com/vi/rkrsuoYE9Uw/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/rkrsuoYE9Uw/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/rkrsuoYE9Uw/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/rkrsuoYE9Uw/maxresdefault.jpg"
    }
  },
  {
    "id": "jhtglrWgKMY",
    "title": "Greatland Gold Town Hall Q&A",
    "date": "2025-05-08",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=jhtglrWgKMY",
        "platform": "YouTube"
      }
    ],
    "duration": "44m 59s",
    "duration_iso": "PT44M59S",
    "description": "Welcome to the Greatland Gold May Town Hall Q&A with MD Shaun Day –hosted by Copia Digital and Ticker TV.  This is where we collect your questions and get Shaun to answer them. \n\nAs most of you know, Shaun had his travel problems getting to the UK. He  powered through and presented at our hastily rearranged in-person Town Hall after 36 hours of travel and a medical emergency stopover in the Maldives.\n\nThe high-achieving Mid-Cap Australian gold/copper producer emerging from the Havieron/Telfer purchase is clearly a very different beast. With physical gold priced at an all time high, the first Quarterly Results released in March set a  high bar. \n\nDespite losing a day, Shaun still made time for an online Town Hall Q&A. Donald Leggatt from Ticker TV/Copia Digital caught up with the Greatland Gold MD and put some of your many excellent questions to him here.\n\n#gold #ggp #greatlandgold #copper  #asx  #aim #tungsten",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/jhtglrWgKMY/default.jpg",
      "medium": "https://i.ytimg.com/vi/jhtglrWgKMY/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/jhtglrWgKMY/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/jhtglrWgKMY/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/jhtglrWgKMY/maxresdefault.jpg"
    }
  },
  {
    "id": "N2Od3N3XeJc",
    "title": "Barton Gold interview with Alex Scanlon, MD & CEO",
    "date": "2025-05-06",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=N2Od3N3XeJc",
        "platform": "YouTube"
      }
    ],
    "duration": "27m 47s",
    "duration_iso": "PT27M47S",
    "description": "Barton Gold (ASX:BGD), the profitable small-cap Australian-listed gold/silver developer have just released a Scoping Study outlining the positive economics for their Tunkillia gold/silver mine project, helped by gold being at a record high.  \n\nBarton also have a gold/silver project at Tarcoola and own a processing mill at Central Gawler, all in South Central Australia and within fly-in distance from Adelaide, the nearest major City. \n\nAlex Scanlon, MD and CEO at Barton Gold joined Ticker TV’s Donald Leggatt from Adelaide in South Australia to give investors an update on the latest scoping study announcement, and to bring those interested up to speed with the very latest funding and development plans for the portfolio.\n\nAlex is an expert in physical gold, and with the gold price at an all-time high we asked him for his view on the long term structural changes affecting the market, and whether in his opinion now is a time to buy, sell or hold.   \n\nFirst though to Barton Gold and South Central Australia, where Alex and the team strategically started to acquire assets a few years ago.",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/N2Od3N3XeJc/default.jpg",
      "medium": "https://i.ytimg.com/vi/N2Od3N3XeJc/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/N2Od3N3XeJc/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/N2Od3N3XeJc/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/N2Od3N3XeJc/maxresdefault.jpg"
    }
  },
  {
    "id": "5qkOvufYk18",
    "title": "Sound Energy Interview with Graham Lyon, Executive Chairman",
    "date": "2025-04-29",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=5qkOvufYk18",
        "platform": "YouTube"
      }
    ],
    "duration": "24m 13s",
    "duration_iso": "PT24M13S",
    "description": "Sound Energy are an AIM-listed Morocco-focused gas developer and explorer. For the first time in their existence they have 10 million dollars in the bank and a fully funded carry on their 20%-owned Tendrara gas pipeline project, which is where the majority of the revenue lies. In addition they have a fully funded carry on two nearby gas and oil exploration wells (27% owned) and a 20% share of the virtually first-gas ready LNG plant at Tendrara in Morocco which will be revenue generating in 6 months. \n\n- Tendrara is the biggest gas discovery in Morocco, and the project comes in two phases. The LNG plant, operated by ManaEnergy and serviced by \nAfriquaGaz, is virtually built, with first gas due in Q4 2025.\n\n-The second phase, also operated by Managem Group, is for a ‘gas to power’ pipeline which links into the regional GME gas pipeline. A Final Investment Decision is expected there by the end of the year.   \n\nSound Energy Executive Chairman Graham Lyon was joined for a detailed fireside chat by Donald Leggatt from Ticker TV. \n\n#sou #soundenergy #morocco #gas #tendrara",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/5qkOvufYk18/default.jpg",
      "medium": "https://i.ytimg.com/vi/5qkOvufYk18/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/5qkOvufYk18/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/5qkOvufYk18/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/5qkOvufYk18/maxresdefault.jpg"
    }
  },
  {
    "id": "ojf5INTkw50",
    "title": "Interview with Jasper Smith of Arksen",
    "date": "2025-04-25",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=ojf5INTkw50",
        "platform": "YouTube"
      }
    ],
    "duration": "17m 7s",
    "duration_iso": "PT17M7S",
    "description": "It isn’t every day you get to work alongside #DavidAttenborough and attempt to save our oceans, yet that's just what Jasper Smith is doing right now. The founder and CEO of iconic outdoor explorer equipment brand Arksen has co-produced Sir David’s latest hard-hitting documentary #Ocean - which shows what a magical place the ocean is, but illustrates vividly what poor health it is in. Jasper hopes that the film will help to raise awareness about the ocean and as a consequence raise funds to conserve our seas through the charitable foundation 10 Percent For the Ocean.\n\nOcean by David Attenborough trailer link\nhttps://lnkd.in/exwDu5cq\n\nArksen link\nhttps://www.arksen.com\n\n10% for the Ocean Charitable Foundation link\nhttps://lnkd.in/dv4PqMcP\n\n#ARKSEN #DAVIDATTENBOROUGH #10PERCENTFORTHEOCEAN #OCEANFILM #OCEAN",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/ojf5INTkw50/default.jpg",
      "medium": "https://i.ytimg.com/vi/ojf5INTkw50/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/ojf5INTkw50/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/ojf5INTkw50/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/ojf5INTkw50/maxresdefault.jpg"
    }
  },
  {
    "id": "z1AeLbjK2E4",
    "title": "Orosur Mining successfully raise CA$6M and CEO Brad George explains the #OMI strategy in detail",
    "date": "2025-04-01",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=z1AeLbjK2E4",
        "platform": "YouTube"
      }
    ],
    "duration": "31m 52s",
    "duration_iso": "PT31M52S",
    "description": "Orosur Mining #OMI is a focused gold and minerals explorer running projects in South America and West Africa. Orosur has just successfully raised around 6 million Canadian dollars, (approximately £3,240,000) in an oversubscribed placing with Canadian institutions. \n\nBrad George CEO said he was delighted to broaden the shareholder base into Canada, and at the same time attract institutional interest. With 95% of shareholders in the UK he said it was imperative to ‘use it or lose it’ in Canada.\n\nIn an educational and in-depth fireside chat, Brad talked Donald Leggatt from Ticker TV through the Junior Miner’s strategy and its evolution. \n\nOrosur Mining’s strategy is to discover Tier One projects, and the company currently has a market cap of around £36 million pounds. It owns 100% of the Anza project in Columbia, 51% of El Pantano in Argentia with the option to own 100%, and with lithium projects in Nigeria. \n\nOrosur is dual-listed on the ASX.V and AIM, and with substantial recent gold finds at Pepas and El Cedro, part of the Anza gold project, the explorer has caught investors attention. \n\nMore on these finds, an update on Argentina and much more besides in our interview.",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/z1AeLbjK2E4/default.jpg",
      "medium": "https://i.ytimg.com/vi/z1AeLbjK2E4/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/z1AeLbjK2E4/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/z1AeLbjK2E4/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/z1AeLbjK2E4/maxresdefault.jpg"
    }
  },
  {
    "id": "0hdulB8ea1Q",
    "title": "Chile-focused CleanTech Lithium to raise £2M from retail shareholders ahead of strong newsflow",
    "date": "2025-02-20",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=0hdulB8ea1Q",
        "platform": "YouTube"
      }
    ],
    "duration": "27m 32s",
    "duration_iso": "PT27M32S",
    "description": "CleanTech Lithium (AIM:CTL) the Direct Lithium Extraction (DLE) specialist developing several sustainable lithium projects in Chile, has recently raised £2.4M in a placing from  resource funds and sophisticated investors, most of whom are current shareholders. CleanTech have followed this up with a retail offering on Bookbuild which aims to raise a further £2M from existing retail shareholders.\n\nChief Financial Officer Gordon Stein spoke to Donald Leggatt on Ticker TV and explained that with the demand for lithium set to outgrow supply, and with #CTL set to experience several positive buy catalysts over the next few months (ASX listing, PFS for the flagship Laguna Verde project and a Government special lithium operating contract to be announced) now may be an appropriate time to invest.",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/0hdulB8ea1Q/default.jpg",
      "medium": "https://i.ytimg.com/vi/0hdulB8ea1Q/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/0hdulB8ea1Q/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/0hdulB8ea1Q/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/0hdulB8ea1Q/maxresdefault.jpg"
    }
  },
  {
    "id": "U1T4VAk11Nw",
    "title": "CQS Natural Resources Growth and Income Fund faces Saba takeover vote threat",
    "date": "2025-01-28",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=U1T4VAk11Nw",
        "platform": "YouTube"
      }
    ],
    "duration": "26m 16s",
    "duration_iso": "PT26M16S",
    "description": "CQS Natural Resources Growth and Income Fund PLC is one of 7 UK Investment Trusts facing the threat of takeover by Saba Capital Management, the US activist Hedge  Fund.\n\nWe were joined by Chairman Christopher Casey and joint Fund Managers Rob Crayfourd and Keith Watson to hear in detail why global Metals and Mining specialists  CQS are against the takeover. \n\nWith a significant number of shares in retail hands, mobilising private investors  to vote at the forthcoming General Meeting is critical.\n\nFor more information and voting guidance go to: cynprotectyourinvestment.com",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/U1T4VAk11Nw/default.jpg",
      "medium": "https://i.ytimg.com/vi/U1T4VAk11Nw/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/U1T4VAk11Nw/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/U1T4VAk11Nw/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/U1T4VAk11Nw/maxresdefault.jpg"
    }
  },
  {
    "id": "hIOWrGOfdZs",
    "title": "Nativo Resources - Interview with Non-Executive Chairman Christian Yates and CEO Stephen Birrell",
    "date": "2024-10-24",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=hIOWrGOfdZs",
        "platform": "YouTube"
      }
    ],
    "duration": "28m 59s",
    "duration_iso": "PT28M59S",
    "description": "#gold #mining #goldmines #goldmining #preciousmetals #peru #investing #financialinformation \nNativo Resources (LON:NTVO) is a Peru-focused developer and soon-to-be producer of artisanal gold and silver in Northern Peru. Echo Energy was recently renamed Nativo, and senior management have refocused the business on artisanal mining in Peru, moving on from legacy energy assets in Argentina. \n\nIn an in-depth interview with Ticker TV, Nativo Resources Non-Executive Chairman Christian Yates and CEO Stephen Birrell discussed the new Peru-focused artisanal gold and silver strategy for the company, which they have been developing since taking control in November 2023.  \n\nThis is divided into two strands: Nativo has bought a 50% stake in the Tesoro Gold Concession in Northern Peru for $750,000, and the strategy there is to kick-start this artisanal gold mine quickly, to develop production and to reinvest revenues. The company believes this is where the quick wins are, and options to buy land and create a processing plant to process ore from Tesoro (60 tonnes per day) and from other artisanal producers has recently been signed.\n\nThe second, medium-term focus for the business is to develop a separate revenue stream clearing up legacy polymetallic tailings dumps in Southern Peru, extracting gold and silver from these and sorting out any hazards as part of the clean-up process. Three sites in close proximity to one another have been identified, with tailings of around 5 million tonnes in total.  \nChristian Yates and Stephen Birrell were interviewed by Donald Leggatt, Head of IR Media at Ticker TV.\n\n0:00 Introduction\n0:57 Change of name and sector\n5:17 What do you get out of the Tesoro deal\n6:10 Tesoro, a long history of gold production and data\n8:49 High grade assays and 5 main gold veins announcement\n11:36 Mining plan; how will Tesoro be mined\n13:48 Agreeing offtake terms with third party producers\n15:33 Next steps for the Bako 50:50 JV\n16:28 Funding and development of the new processing plant\n24:57 Capex and funding requirements\n26:58 The vision for Nativo Resources; two years time",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/hIOWrGOfdZs/default.jpg",
      "medium": "https://i.ytimg.com/vi/hIOWrGOfdZs/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/hIOWrGOfdZs/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/hIOWrGOfdZs/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/hIOWrGOfdZs/maxresdefault.jpg"
    }
  },
  {
    "id": "s7T5h4qi28c",
    "title": "Helium One - CEO Interview",
    "date": "2024-09-05",
    "contentType": "podcast",
    "links": [
      {
        "type": "video",
        "url": "https://www.youtube.com/watch?v=s7T5h4qi28c",
        "platform": "YouTube"
      }
    ],
    "duration": "15m 6s",
    "duration_iso": "PT15M6S",
    "description": "Ticker's Donald Leggatt interviews Helium One CEO, Lorna Blaisse.\n\nIn this exclusive video, we dive into Helium One Global’s latest breakthrough at the Itumbula West-1 (ITW-1) well site in Tanzania. Following the successful completion of extended well test (EWT) operations, the company has confirmed a significant helium discovery with sustained flow rates of up to 5.5% helium. This marks a major milestone for the project and positions Helium One at the forefront of helium exploration.",
    "thumbnails": {
      "default": "https://i.ytimg.com/vi/s7T5h4qi28c/default.jpg",
      "medium": "https://i.ytimg.com/vi/s7T5h4qi28c/mqdefault.jpg",
      "high": "https://i.ytimg.com/vi/s7T5h4qi28c/hqdefault.jpg",
      "standard": "https://i.ytimg.com/vi/s7T5h4qi28c/sddefault.jpg",
      "maxres": "https://i.ytimg.com/vi/s7T5h4qi28c/maxresdefault.jpg"
    }
  }
]